#include <stdio.h>
#include <stdlib.h>

int main(){
    // BITWISE OPERATORS 位元操作 
    /*
    & = AND
    | = OR
    ^ = XOR
    << = left shift
    >> = right shift
    ~ = NOT 將該值的0位元轉成1，1轉成0，也就是取補數
    */
    int x = 6;  //二進位: 0000110
    int y = 12; //二進位: 0001100
    int z = 0;  //二進位: 0000000

    //int z1 = x & y; 
    // 二進位中兩個都是 1 才會是 1
    // z1 = 6 & 12 =   0000110 
    //               & 0001100
    //--------------------------
    //                 0000100 = 4
    int z2 = x | y; 
    // 二進位中有一個是 1 就都轉乘 1
    // z1 = 6 & 12 =   0000110 
    //               | 0001100
    //--------------------------
    //                 0001110 = 14
    int z3 = x & z; // 任何人跟 0 做AND 都會是 0
    int z4 = x | z; // 任何人跟 0 做OR 都會是原本的數值

    int x1 = x << 1;
    // x1 = 6 << 1 = 0000110 << 1 = 0001100 = 12 
    // 該數值左移就代表 該數值乘上2的n次方，<<1就代表乘2、<<2就代表乘4
    int x2 = x >> 1;
    // x1 = 6 >> 1 = 0000110 >> 1 = 0000011 = 3 
    // 該數值左移就代表 該數值除上2的n次方，<<1就代表除2、<<2就代表除4
    
    //int y1 = ~(y<<31);
    int y1 = ~y;

    printf("%d\n", 14<<4);
    printf("%d\n", z2);
    printf("%d\n", z3);
    printf("%d\n", z4);
    printf("%d\n", x1); 
    printf("%d\n", x2);
    printf("%d\n", y1);


   return 0;
}